config.org
#+TITLE: (Doom) Emacs Configuration
#+AUTHOR: zedkaido

#+BEGIN_QUOTE
No rules are universal (except this one).
#+END_QUOTE

* Core Configurations (config.el)
Jiggle things up with lexical binding (see [[https://nullprogram.com/blog/2016/12/22/][this blog post]] for more info).
#+begin_src emacs-lisp :comments no
;;; config.el -*- lexical-binding: t; -*-
#+end_src

** User Info
You know, all the conventional stuff...
#+begin_src emacs-lisp
(setq
 user-full-name "Zed Kaido"
 user-mail-address "dm@zedkaido.com")
#+end_src

** GPG
#+begin_src emacs-lisp
(setq auth-sources '("~/.doom.d/.authinfo.gpg"))
#+end_src

** Sweat Defaults
#+BEGIN_QUOTE
We either live with intention or exist by default.
#+END_QUOTE

Maximize frame on startup
#+begin_src emacs-lisp
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
#+end_src

Good old defaults
#+begin_src emacs-lisp
(setq-default delete-by-moving-to-trash t
							line-number-mode 1 ;; (modeline)
							column-number-mode 1 ;; (modeline)
							global-display-line-numbers-mode nil
							global-hl-line-mode nil
							global-hl-line-modes nil
							display-line-numbers-type nil
							editorconfig-mode 1
							indent-tabs-mode t
							tab-width 3)
#+end_src

Smartparens get in the way (it's faster to type)
#+begin_src emacs-lisp
(remove-hook 'doom-first-buffer-hook #'smartparens-global-mode)
#+end_src

Make Renaming File + Buffer easy
#+begin_src emacs-lisp
(defun rename-file-and-buffer ()
	"Rename the current buffer and the file it is visiting."
	(interactive)
	(let ((filename (buffer-file-name)))
		(if (not (and filename (file-exists-p filename)))
	(message "Buffer is not visiting a file!")
			(let ((new-name (read-file-name "New name: " filename)))
	(cond ((vc-backend filename) (vc-rename-file filename new-name))
							(t (rename-file filename new-name t)
		 (set-visited-file-name new-name t)))
	))))
#+end_src

*** Performance Boosters
Let's put some thrusters on the back of this "Roadster".

Emacs has the capability to display ~left-to-right~ and ~right-to-left~ languages at the
same time in the same buffer. I don't need it. Because it adds to the amount of line scans
that Emacs has to do to render a line, here are some changes.
#+begin_src emacs-lisp
(setq-default bidi-paragraph-direction 'left-to-right)
#+end_src

When the lines in a file are so long that performance could suffer to an unacceptable
degree, the following invokes something much more basic.
#+begin_src emacs-lisp
(global-so-long-mode 1)
#+end_src

Allow 20MB of memory before calling garbage collection. GS runs less often, sped up operations.
#+begin_src emacs-lisp
(setq gc-cons-threshold 24242424)
#+end_src

-----
*NOTE*: You can test and evaluate performance with ~profiler-start~ and ~profiler-stop~.

** User Interface
*** Font Face
The *ultimate* font for hackers.
#+begin_src emacs-lisp
(setq
 doom-font (font-spec :family "JetBrains Mono" :size 13)
 doom-big-font (font-spec :family "JetBrains Mono" :size 13)
 doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 13)
 doom-serif-font (font-spec :family "JetBrains Mono" :size 13))
#+end_src

*** Theme
My *ultimate* theme.
#+begin_src emacs-lisp
(load-theme 'zk-white t)
#+end_src

**** Cursor
#+begin_src emacs-lisp
(setq evil-normal-state-cursor '(box)
			evil-insert-state-cursor '(box)
			evil-visual-state-cursor '(hollow)
			evil-operator-state-cursor '(box "#404040")
			evil-replace-state-cursor '(hollow))
#+end_src

*** Modeline
"~path/filename"
#+begin_src emacs-lisp
(setq-default mode-line-buffer-identification
							'(:eval (propertize
											 (concat (abbreviate-file-name (file-name-directory buffer-file-name))
															 (file-name-nondirectory buffer-file-name))
											 'face 'mode-line-filename)))
#+end_src

And a simple modeline:
#+begin_src emacs-lisp
(setq-default
 mode-line-format
 '("%e"
	 mode-line-front-space
	 mode-line-mule-info
	 mode-line-client
	 mode-line-modified
	 mode-line-remote
	 mode-line-frame-identification
	 mode-line-buffer-identification
	 "   "
	 "<ETC?>" ;; ETC Reminder (Easier To Change)
	 "   "
	 mode-line-position
	 (vc-mode vc-mode)
	 "  "
	 mode-name
	 "  "
	 mode-line-process
	 "  "
	 mode-line-misc-info mode-line-end-spaces))
#+end_src

Show vim mode in modeline
#+begin_src emacs-lisp
(setq evil-mode-line-format '(before . mode-line-front-space))
#+end_src

** Bindings
Life-time savers (kinda).
*** (Enable/Disable) Fill column
#+begin_src emacs-lisp
(map! :leader
			(:prefix "b"
			 :desc "Display fill-column indicator"    "f" #'display-fill-column-indicator-mode))
#+end_src

*** File
#+begin_src emacs-lisp
(map!
 :leader
 (:prefix-map ("f" . "file")
							(:prefix-map ("g" . "goto")
							 :desc "tmp"          "t" (cmd! (find-file "/tmp"))
							 :desc "drive"        "/" (cmd! (find-file "/"))
							 :desc "home"         "h" (cmd! (find-file "~"))
							 :desc "zk"           "z" (cmd! (find-file "~/zk"))
							 :desc "books"        "g" (cmd! (find-file "~/zk/books"))
							 :desc "Org Roam"       "g" (cmd! (find-file "~/zk/org"))
							 :desc "projects"     "p" (cmd! (find-file "~/zk/projects"))
							 :desc "music"        "m" (cmd! (find-file "~/zk/music"))
							 :desc "desktop"      "D" (cmd! (find-file "~/Desktop"))
							 :desc "downloads"    "d" (cmd! (find-file "~/Downloads"))
							 )))
#+end_src

*** Counsel
#+begin_src emacs-lisp
(map!
 :leader
 (:prefix-map ("c" . "code")
							(:prefix-map ("b" . "Counsel")
							 :desc "Find" "/" 'counsel-dash
							 :desc "Find (by Cursor)" "." 'counsel-dash-at-point
							 :desc "Activate Doc in Buffer" "a" 'counsel-dash-activate-docset
							 :desc "Deactivate Doc to Buffer" "d" 'counsel-dash-deactivate-docset)))
#+end_src

*** Org-Roam
#+begin_src emacs-lisp
(map!
 :leader
 (:prefix-map ("t" . "toggle")
	:desc "Org-Roam Buffer" "o" 'org-roam-buffer-toggle-display
	:desc "Composition Mode (Ligatures)" "c" 'toggle-auto-composition))
#+end_src


** (init.el) Doom Configuration
*** Modules
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:

Doom has this lovely /modular configuration base/ that takes a lot of work out of
configuring Emacs. Each module (when enabled) can provide a list of packages to
install (on ~doom sync~) and configuration to be applied. The modules can also
have flags applied to tweak their behaviour.

#+name: init.el
#+attr_html: :collapsed t
#+begin_src emacs-lisp :tangle "init.el" :noweb no-export :noweb-ref none
;;; init.el -*- lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load in.
;; Press 'K' on a module to view its documentation, and 'gd' to browse its directory.

(doom! :input
			 <<doom-input>>

			 :completion
			 <<doom-completion>>

			 :ui
			 <<doom-ui>>

			 :editor
			 <<doom-editor>>

			 :emacs
			 <<doom-emacs>>

			 :term
			 <<doom-term>>

			 :checkers
			 <<doom-checkers>>

			 :tools
			 <<doom-tools>>

			 :os
			 <<doom-os>>

			 :lang
			 <<doom-lang>>

			 :email
			 <<doom-email>>

			 :app
			 <<doom-app>>

			 :config
			 <<doom-config>>
			 )
#+end_src

**** Structure
As you may have noticed by this point, this is a [[https://en.wikipedia.org/wiki/Literate_programming][literate]] configuration. Doom
has good support for this which we access though the ~literate~ module.

While we're in the src_elisp{:config} section, we'll use Dooms nicer defaults,
along with the bindings and smartparens behaviour (the flags aren't documented,
but they exist).
#+name: doom-config
#+begin_src emacs-lisp
literate
(default +bindings)          ; +smartparens is an option (I like writing)
#+end_src

