config.el
;;; config.el -*- lexical-binding: t; -*-

(setq
 user-full-name "Zed Kaido"
 user-mail-address "dm@zedkaido.com")

(setq auth-sources '("~/.doom.d/.authinfo.gpg"))

(add-to-list 'initial-frame-alist '(fullscreen . maximized))

(setq-default delete-by-moving-to-trash t
							line-number-mode 1 ;; (modeline)
							column-number-mode 1 ;; (modeline)
							global-display-line-numbers-mode nil
							global-hl-line-mode nil
							global-hl-line-modes nil
							display-line-numbers-type nil
							editorconfig-mode 1
							indent-tabs-mode t
							tab-width 3)

(remove-hook 'doom-first-buffer-hook #'smartparens-global-mode)

(defun rename-file-and-buffer ()
	"Rename the current buffer and the file it is visiting."
	(interactive)
	(let ((filename (buffer-file-name)))
		(if (not (and filename (file-exists-p filename)))
	(message "Buffer is not visiting a file!")
			(let ((new-name (read-file-name "New name: " filename)))
	(cond ((vc-backend filename) (vc-rename-file filename new-name))
							(t (rename-file filename new-name t)
		 (set-visited-file-name new-name t)))
	))))

(setq-default bidi-paragraph-direction 'left-to-right)

(global-so-long-mode 1)

(setq gc-cons-threshold 24242424)

(setq
 doom-font (font-spec :family "JetBrains Mono" :size 13)
 doom-big-font (font-spec :family "JetBrains Mono" :size 13)
 doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 13)
 doom-serif-font (font-spec :family "JetBrains Mono" :size 13))

(load-theme 'zk-white t)

(setq evil-normal-state-cursor '(box)
			evil-insert-state-cursor '(box)
			evil-visual-state-cursor '(hollow)
			evil-operator-state-cursor '(box "#404040")
			evil-replace-state-cursor '(hollow))

(setq-default mode-line-buffer-identification
							'(:eval (propertize
											 (concat (abbreviate-file-name (file-name-directory buffer-file-name))
															 (file-name-nondirectory buffer-file-name))
											 'face 'mode-line-filename)))

(setq-default
 mode-line-format
 '("%e"
	 mode-line-front-space
	 mode-line-mule-info
	 mode-line-client
	 mode-line-modified
	 mode-line-remote
	 mode-line-frame-identification
	 mode-line-buffer-identification
	 "   "
	 "<ETC?>" ;; ETC Reminder (Easier To Change)
	 "   "
	 mode-line-position
	 (vc-mode vc-mode)
	 "  "
	 mode-name
	 "  "
	 mode-line-process
	 "  "
	 mode-line-misc-info mode-line-end-spaces))

(setq evil-mode-line-format '(before . mode-line-front-space))

(map! :leader
			(:prefix "b"
			 :desc "Display fill-column indicator"    "f" #'display-fill-column-indicator-mode))

(map!
 :leader
 (:prefix-map ("f" . "file")
							(:prefix-map ("g" . "goto")
							 :desc "tmp"          "t" (cmd! (find-file "/tmp"))
							 :desc "drive"        "/" (cmd! (find-file "/"))
							 :desc "home"         "h" (cmd! (find-file "~"))
							 :desc "zk"           "z" (cmd! (find-file "~/zk"))
							 :desc "books"        "g" (cmd! (find-file "~/zk/books"))
							 :desc "Org Roam"       "g" (cmd! (find-file "~/zk/org"))
							 :desc "projects"     "p" (cmd! (find-file "~/zk/projects"))
							 :desc "music"        "m" (cmd! (find-file "~/zk/music"))
							 :desc "desktop"      "D" (cmd! (find-file "~/Desktop"))
							 :desc "downloads"    "d" (cmd! (find-file "~/Downloads"))
							 )))

(map!
 :leader
 (:prefix-map ("c" . "code")
							(:prefix-map ("b" . "Counsel")
							 :desc "Find" "/" 'counsel-dash
							 :desc "Find (by Cursor)" "." 'counsel-dash-at-point
							 :desc "Activate Doc in Buffer" "a" 'counsel-dash-activate-docset
							 :desc "Deactivate Doc to Buffer" "d" 'counsel-dash-deactivate-docset)))

(map!
 :leader
 (:prefix-map ("t" . "toggle")
	:desc "Org-Roam Buffer" "o" 'org-roam-buffer-toggle-display
	:desc "Composition Mode (Ligatures)" "c" 'toggle-auto-composition))
