config.org
**** Convenient
The worst part about ~org-mode~? Having to leave it.
#+begin_src emacs-lisp
(package! org-pandoc-import
	:recipe (:host github
					 :repo "tecosaur/org-pandoc-import"
					 :files ("*.el" "filters" "preprocessors")))
#+end_src

When in need of logging commands.
#+begin_src emacs-lisp
(package! command-log-mode)
#+end_src

Every one needs to jump around dumbly from time to time, right?
#+begin_src emacs-lisp
(package! dumb-jump)
#+end_src

Elisp formatting
#+begin_src emacs-lisp
(package! elisp-format)
#+end_src

Engine Mode
#+begin_src emacs-lisp
(package! engine-mode)
#+end_src

Who doesn't read EPUBs?
#+begin_src emacs-lisp
(package! nov)
#+end_src

Movedidakadooo
#+begin_src emacs-lisp
(package! transpose-frame)
#+end_src

Screenshot away the world
#+begin_src emacs-lisp
(package! screenshot :recipe (:local-repo "lisp/screenshot"))
#+end_src

org-roam-ui (zettelkasten)
#+begin_src emacs-lisp
(unpin! org-roam) ;; use the latest version of org-roam
(package! org-roam-ui)
#+end_src

keycast for (when you need to show the keys you are pressing)
#+begin_src emacs-lisp
(package! keycast)
#+end_src

Who uses their mouse in their editor?
#+begin_src emacs-lisp
(package! disable-mouse)
#+end_src

**** Language Support
If it ain't useful and fast, why bother?

Svelte, the love of my life.
#+begin_src emacs-lisp
(package! svelte-mode)
#+end_src

Prettier-js for beatiful js code
#+begin_src emacs-lisp
(package! prettier-js)
#+end_src

**** AIs
#+begin_src emacs-lisp
(package! org-ai)
#+end_src

*** Balderdash (Disabled) Packages
Cause why in the world were they included?

Disable package that overlays code with errors/warnings from Flycheck
#+begin_src emacs-lisp
(package! flycheck-popup-tip :disable t)
#+end_src

** (config.el) Package Configuration
*** Calc
Cause radians are rad.
#+begin_src emacs-lisp
(setq calc-angle-mode 'rad
			calc-algebraic-mode t ;; allows '2*x instead of 'x<RET>2*
			calc-symbolic-mode t) ;; keeps stuff like √2 irrational for as long as possible
#+end_src

*** Company
Completion is nice but, only when I want it... I might actually want it :)
#+begin_src emacs-lisp
(after! company
	(setq company-idle-delay nil)
	(add-hook 'evil-normal-state-entry-hook #'company-abort))
#+end_src

Also, improve ~company~ (related) memory.
#+begin_src emacs-lisp
(setq-default history-length 50)
(setq-default history-delete-duplicates t)
#+end_src

*** Prettier
i find it a bit intrusive to have it automatically on. code is prose.
#+begin_src emacs-lisp
;; (add-hook 'js2-mode-hook 'prettier-js-mode)
;; (add-hook 'web-mode-hook 'prettier-js-mode)
#+end_src

#+begin_src emacs-lisp
(setq prettier-js-args '(
			 "--use-tabs" "true"
			 "--tab-width" 2
			 "--single-quote" "true"
			 "--trailing-comma" "all"
			 "--bracket-spacing" "false"
			 ))
#+end_src

*** Which-key
make it pop up faster
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.5) ;; I need the help, I really do
#+end_src

*** Dumb-Jump
Enable ~xref~ back-end.
#+BEGIN_SRC emacs-lisp
(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
#+END_SRC

And, in case things go sideways:
#+BEGIN_SRC emacs-lisp
(setq dumb-jump-default-project "~/main")
#+END_SRC

*** EVIL
So there's this one package called ~evil-escape~. Here's the thing, I don't use it. So...
#+BEGIN_SRC emacs-lisp
(after! evil (evil-escape-mode -1))
#+END_SRC

Also think that having evil- appear in so many popups is a bit too verbose, let’s change that, and do a few other similar tweaks while we’re at it.
#+begin_src emacs-lisp
(setq which-key-allow-multiple-replacements t)
(after! which-key
	(pushnew!
	 which-key-replacement-alist
	 '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
	 '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
	 ))
#+end_src

*** disable-mouse
I ❤️ my keyboard
#+begin_src emacs-lisp
(global-disable-mouse-mode)
;; And, for evil's individual states.
(mapc #'disable-mouse-in-keymap
      (list evil-motion-state-map
            evil-normal-state-map
            evil-visual-state-map
            evil-insert-state-map))
#+end_src

*** Nov (EPUBs)
The place all want to spend their time.
#+begin_src emacs-lisp
(setq nov-text-width 100)
(use-package! nov
	:mode ("\\.epub\\'" . nov-mode)
	:config
	(setq nov-save-place-file (concat doom-cache-dir "nov-places")))
#+end_src

*** Org-Download
#+BEGIN_SRC emacs-lisp
(add-hook 'dired-mode-hook 'org-download-enable)
(setq org-download-image-dir "~/zk/org/images")
#+END_SRC

*** Org-Roam
The thinking process.
#+BEGIN_SRC emacs-lisp
(setq org-roam-directory "~/zk/org")
#+END_SRC

**** org-roam-ui
#+begin_src emacs-lisp
(use-package! websocket
	:after org-roam)

(use-package! org-roam-ui
	:after org-roam ;; or :after org
	;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
	;;         a hookable mode anymore, you're advised to pick something yourself
	;;         if you don't care about startup time, use
	;;  :hook (after-init . org-roam-ui-mode)
	:config
	(setq org-roam-ui-sync-theme t
				org-roam-ui-follow t
				org-roam-ui-update-on-save t
				org-roam-ui-open-on-start t))
#+end_src

*** Org-Pandoc
#+begin_src emacs-lisp
(use-package! org-pandoc-import :after org)
#+end_src

*** Projectile
All about those projects.
#+BEGIN_SRC emacs-lisp
(setq projectile-project-search-path '("~/zk"))
(setq projectile-ignored-projects
			(list "~/" "/tmp"))
#+END_SRC

*** Ligatures
Make it click.
#+begin_src emacs-lisp
(setq +ligatures-in-modes '(not org-mode special-mode))
#+end_src

*** Engine-Mode
All the www is at my fingertips.
#+begin_src emacs-lisp
(setq engine-mode t)
#+end_src

Effective Search Engines.
#+begin_src emacs-lisp
(defengine brave
	"https://search.brave.com/search?q=%s"
	:keybinding "b"
	:browser 'eww-browse-url)

(defengine hoogle
	"https://hoogle.haskell.org/?hoogle=%s"
	:keybinding "h"
	:browser 'eww-browse-url)
#+end_src

**** Elfeed
RSS for life.
#+begin_src emacs-lisp
(setq elfeed-feeds
			'("http://nullprogram.com/feed/"
	"https://planet.emacslife.com/atom.xml"
	"https://zedkaido.com/rss.xml"
	"https://lukesmith.xyz/index.xml"
	"https://stallman.org/rss/rss.xml"
	))
#+end_src

**** Lookup Settings (Alternative Search Engines)
Lookup search engines
#+begin_src emacs-lisp
(setq +lookup-provider-url-alist
			'(
				("DuckDuckGo" +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
				("Hoogle" "https://hoogle.haskell.org/?hoogle=%s")
				("Google" +lookup--online-backend-google "https://google.com/search?q=%s")
				("Google images" "https://www.google.com/images?q=%s")
				("Google maps" "https://maps.google.com/maps?q=%s")
				("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
				("Archive" "https://archive.org/searchresults.php?search=%s&sin=&limit=100&fts_terms=&start=0&searchAll=yes&submit=this+was+submitted")
				("PDFdrive" "https://www.pdfdrive.com/search?q=%s&pagecount=&pubyear=&searchin=&em=")
				("DevDocs.io" "https://devdocs.io/#q=%s")
				("StackOverflow" "https://stackoverflow.com/search?q=%s")
				("Github" "https://github.com/search?ref=simplesearch&q=%s")
				("Youtube" "https://youtube.com/results?aq=f&oq=&search_query=%s")
				("Twitter" "https://twitter.com/search?q=%s")
				("Wolfram alpha" "https://wolframalpha.com/input/?i=%s")
				("Wikipedia" "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
				("MDN" "https://developer.mozilla.org/en-US/search?q=%s")
				("Rust Docs" "https://doc.rust-lang.org/std/?search=%s")
				("Doom Emacs issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
				)
			)
#+end_src

*** IRC Circe Config
#+begin_src emacs-lisp
(defun my-fetch-password (&rest params)
  (require 'auth-source)
  (let ((match (car (apply 'auth-source-search params))))
    (if match
        (let ((secret (plist-get match :secret)))
          (if (functionp secret)
              (funcall secret)
            secret))
      (error "Password not found for %S" params))))

(defun my-nickserv-password (server)
  (my-fetch-password :user "zedkaido" :machine "irc.libera.chat"))

(setq circe-network-options
      '(("Libera Chat"
         :nick "zedkaido"
         :channels ("#web" "#internet" "200ok" "haskell")
         :nickserv-password my-nickserv-password)))
#+end_src

*** ZEN
#+begin_src emacs-lisp
(setq +zen-text-scale 0.8)
#+end_src

*** Org Mode
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/.org"
			org-log-done 'time
			org-export-in-background t
			org-catch-invisible-edits 'smart)
#+END_SRC

#+begin_src emacs-lisp
(after! org
	(setq org-fontify-quote-and-verse-block nil
	org-fontify-whole-heading-line nil
	org-hide-leading-stars nil
	))
#+end_src

*** LSP
Language Server Protocol?
#+begin_src emacs-lisp
;; (setq lsp-lens-enable nil
;;       lsp-auto-execute-action nil
;;       lsp-before-save-edits nil
;;       lsp-ui-sideline-enable nil
;;       lsp-modeline-code-actions-mode t
;;       lsp-headerline-breadcrumb-enable nil)
#+end_src

