config.el

(setq calc-angle-mode 'rad
			calc-algebraic-mode t ;; allows '2*x instead of 'x<RET>2*
			calc-symbolic-mode t) ;; keeps stuff like √2 irrational for as long as possible

(after! company
	(setq company-idle-delay nil)
	(add-hook 'evil-normal-state-entry-hook #'company-abort))

(setq-default history-length 50)
(setq-default history-delete-duplicates t)

;; (add-hook 'js2-mode-hook 'prettier-js-mode)
;; (add-hook 'web-mode-hook 'prettier-js-mode)

(setq prettier-js-args '(
			 "--use-tabs" "true"
			 "--tab-width" 2
			 "--single-quote" "true"
			 "--trailing-comma" "all"
			 "--bracket-spacing" "false"
			 ))

(setq which-key-idle-delay 0.5) ;; I need the help, I really do

(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)

(setq dumb-jump-default-project "~/main")

(after! evil (evil-escape-mode -1))

(setq which-key-allow-multiple-replacements t)
(after! which-key
	(pushnew!
	 which-key-replacement-alist
	 '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
	 '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
	 ))

(global-disable-mouse-mode)
;; And, for evil's individual states.
(mapc #'disable-mouse-in-keymap
      (list evil-motion-state-map
            evil-normal-state-map
            evil-visual-state-map
            evil-insert-state-map))

(setq nov-text-width 100)
(use-package! nov
	:mode ("\\.epub\\'" . nov-mode)
	:config
	(setq nov-save-place-file (concat doom-cache-dir "nov-places")))

(add-hook 'dired-mode-hook 'org-download-enable)
(setq org-download-image-dir "~/zk/org/images")

(setq org-roam-directory "~/zk/org")

(use-package! websocket
	:after org-roam)

(use-package! org-roam-ui
	:after org-roam ;; or :after org
	;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
	;;         a hookable mode anymore, you're advised to pick something yourself
	;;         if you don't care about startup time, use
	;;  :hook (after-init . org-roam-ui-mode)
	:config
	(setq org-roam-ui-sync-theme t
				org-roam-ui-follow t
				org-roam-ui-update-on-save t
				org-roam-ui-open-on-start t))

(use-package! org-pandoc-import :after org)

(setq projectile-project-search-path '("~/zk"))
(setq projectile-ignored-projects
			(list "~/" "/tmp"))

(setq +ligatures-in-modes '(not org-mode special-mode))

(setq engine-mode t)

(defengine brave
	"https://search.brave.com/search?q=%s"
	:keybinding "b"
	:browser 'eww-browse-url)

(defengine hoogle
	"https://hoogle.haskell.org/?hoogle=%s"
	:keybinding "h"
	:browser 'eww-browse-url)

(setq elfeed-feeds
			'("http://nullprogram.com/feed/"
	"https://planet.emacslife.com/atom.xml"
	"https://zedkaido.com/rss.xml"
	"https://lukesmith.xyz/index.xml"
	"https://stallman.org/rss/rss.xml"
	))

(setq +lookup-provider-url-alist
			'(
				("DuckDuckGo" +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
				("Hoogle" "https://hoogle.haskell.org/?hoogle=%s")
				("Google" +lookup--online-backend-google "https://google.com/search?q=%s")
				("Google images" "https://www.google.com/images?q=%s")
				("Google maps" "https://maps.google.com/maps?q=%s")
				("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
				("Archive" "https://archive.org/searchresults.php?search=%s&sin=&limit=100&fts_terms=&start=0&searchAll=yes&submit=this+was+submitted")
				("PDFdrive" "https://www.pdfdrive.com/search?q=%s&pagecount=&pubyear=&searchin=&em=")
				("DevDocs.io" "https://devdocs.io/#q=%s")
				("StackOverflow" "https://stackoverflow.com/search?q=%s")
				("Github" "https://github.com/search?ref=simplesearch&q=%s")
				("Youtube" "https://youtube.com/results?aq=f&oq=&search_query=%s")
				("Twitter" "https://twitter.com/search?q=%s")
				("Wolfram alpha" "https://wolframalpha.com/input/?i=%s")
				("Wikipedia" "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
				("MDN" "https://developer.mozilla.org/en-US/search?q=%s")
				("Rust Docs" "https://doc.rust-lang.org/std/?search=%s")
				("Doom Emacs issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
				)
			)

(defun my-fetch-password (&rest params)
  (require 'auth-source)
  (let ((match (car (apply 'auth-source-search params))))
    (if match
        (let ((secret (plist-get match :secret)))
          (if (functionp secret)
              (funcall secret)
            secret))
      (error "Password not found for %S" params))))

(defun my-nickserv-password (server)
  (my-fetch-password :user "zedkaido" :machine "irc.libera.chat"))

(setq circe-network-options
      '(("Libera Chat"
         :nick "zedkaido"
         :channels ("#web" "#internet" "200ok" "haskell")
         :nickserv-password my-nickserv-password)))

(setq +zen-text-scale 0.8)

(setq org-directory "~/.org"
			org-log-done 'time
			org-export-in-background t
			org-catch-invisible-edits 'smart)

(after! org
	(setq org-fontify-quote-and-verse-block nil
	org-fontify-whole-heading-line nil
	org-hide-leading-stars nil
	))

;; (setq lsp-lens-enable nil
;;       lsp-auto-execute-action nil
;;       lsp-before-save-edits nil
;;       lsp-ui-sideline-enable nil
;;       lsp-modeline-code-actions-mode t
;;       lsp-headerline-breadcrumb-enable nil)
