config.org
*** Flycheck
The things that YELLS at your code everytime you make a mistake.
#+begin_src emacs-lisp
(setq flycheck-check-syntax-automatically '(save idle-change mode-enabled))
#+end_src

*** AIS
**** org-ai
#+begin_src emacs-lisp
(require 'org-ai)
(add-hook 'org-mode-hook #'org-ai-mode)
#+end_src

#+begin_src emacs-lisp
(setq org-ai-default-chat-model "gpt-3.5-turbo")
;; (setq org-ai-default-chat-model "gpt-4")
#+end_src

** other
*** helper functions to cleanup gazillion buffers
delete all buffers except the current one
#+begin_src emacs-lisp
(defun kill-other-buffers ()
	"Kill all other buffers."
	(interactive)
	(mapc 'kill-buffer (delq (current-buffer) (buffer-list))))
#+end_src

~dired~ will create buffers for every visited folder (these clears those folder)
#+begin_src emacs-lisp
(defun kill-dired-buffers ()
  "Kill all open dired buffers."
  (interactive)
  (mapc (lambda (buffer)
	  (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
	    (kill-buffer buffer)))
	(buffer-list)))
#+end_src

*** disable ~evil-mode~ for some modes
#+begin_src emacs-lisp
(mapc (lambda (mode)
	(evil-set-initial-state mode 'emacs)) '(elfeed-show-mode
						efleed-search-mode
						forge-pullreq-list-mode
						image-dired-mode
						image-dired-thumbnail-mode
						Info-mode
						))
#+end_src
