config.el

(setq flycheck-check-syntax-automatically '(save idle-change mode-enabled))

(require 'org-ai)
(add-hook 'org-mode-hook #'org-ai-mode)

(setq org-ai-default-chat-model "gpt-3.5-turbo")
;; (setq org-ai-default-chat-model "gpt-4")

(defun kill-other-buffers ()
	"Kill all other buffers."
	(interactive)
	(mapc 'kill-buffer (delq (current-buffer) (buffer-list))))

(defun kill-dired-buffers ()
  "Kill all open dired buffers."
  (interactive)
  (mapc (lambda (buffer)
	  (when (eq 'dired-mode (buffer-local-value 'major-mode buffer))
	    (kill-buffer buffer)))
	(buffer-list)))

(mapc (lambda (mode)
	(evil-set-initial-state mode 'emacs)) '(elfeed-show-mode
						efleed-search-mode
						forge-pullreq-list-mode
						image-dired-mode
						image-dired-thumbnail-mode
						Info-mode
						))
